app/Controllers/LaporanDenda.php

SELECT `tbl_laporan_denda`.`id` as `laporandendaid`, `tbl_laporan_denda`.`judul_laporan`, `tbl_laporan_denda`.`id_laporan_denda`, `tbl_laporan_denda`.`deleted_at`, `tbl_laporan_denda`.`denda_id`, `tbl_laporan_denda`.`jenis_laporan`, `tbl_laporan_denda`.`tgl_laporan`, `tbl_laporan_denda`.`updated_at`, `tbl_denda`.`id_denda`, `tbl_denda`.`denda`, `tbl_denda`.`status`
FROM `tbl_laporan_denda`
JOIN `tbl_denda` ON `tbl_denda`.`id` = `tbl_laporan_denda`.`denda_id`
---
    public function index()
    {
        $data = [
            'title' => 'Data Laporan Peminjaman Perpustakaan | Sistem Informasi Perpustakaan',
        ];

        $this->builder = $this->db->table('tbl_laporan_denda');
        $this->builder->select('tbl_laporan_denda.id as laporandendaid, tbl_laporan_denda.judul_laporan,tbl_laporan_denda.id_laporan_denda, tbl_laporan_denda.deleted_at, tbl_laporan_denda.denda_id, tbl_laporan_denda.jenis_laporan, tbl_laporan_denda.tgl_laporan, tbl_laporan_denda.updated_at, tbl_denda.id_denda, tbl_denda.denda, tbl_denda.status');
        $this->builder->join('tbl_denda', 'tbl_denda.id = tbl_laporan_denda.denda_id');

        $query = $this->builder->get();

SELECT `tbl_laporan_denda`.`id` as `laporandendaid`, `tbl_laporan_denda`.`judul_laporan`, `tbl_laporan_denda`.`id_laporan_denda`, `tbl_laporan_denda`.`deleted_at`, `tbl_laporan_denda`.`denda_id`, `tbl_laporan_denda`.`jenis_laporan`, `tbl_laporan_denda`.`tgl_laporan`, `tbl_laporan_denda`.`updated_at`, `tbl_denda`.`id_denda`, `tbl_denda`.`denda`, `tbl_denda`.`status`
FROM `tbl_laporan_denda`
JOIN `tbl_denda` ON `tbl_denda`.`id` = `tbl_laporan_denda`.`denda_id`
WHERE `tgl_laporan` >= '2023-06-01'
AND `tgl_laporan` <= '2023-06-13'
---
    public function date()
    {
        $startDate = $this->request->getPost('startDate');
        $endDate = $this->request->getPost('endDate');

        $data = [
            'title' => 'Data Laporan Peminjaman Perpustakaan | Sistem Informasi Perpustakaan',
        ];

        $this->builder = $this->db->table('tbl_laporan_denda');
        $this->builder->select('tbl_laporan_denda.id as laporandendaid, tbl_laporan_denda.judul_laporan,tbl_laporan_denda.id_laporan_denda, tbl_laporan_denda.deleted_at, tbl_laporan_denda.denda_id, tbl_laporan_denda.jenis_laporan, tbl_laporan_denda.tgl_laporan, tbl_laporan_denda.updated_at, tbl_denda.id_denda, tbl_denda.denda, tbl_denda.status');
        $this->builder->join('tbl_denda', 'tbl_denda.id = tbl_laporan_denda.denda_id');
        $this->builder->where('tgl_laporan >=', $startDate);
        $this->builder->where('tgl_laporan <=', $endDate);

        $query = $this->builder->get();